# ReadAccessGranted Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Schema..::..ReadAccessGranted Method
Schema Class See Also
---
Checks whether Entities of this Schema may be retrieved by the current add-in.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool ReadAccessGranted()
```

Visual Basic
---
```text
Public Function ReadAccessGranted As Boolean
```

Visual C++
---
```text
public:
bool ReadAccessGranted()
```

# ### Return Value
True if read access is allowed.
# See Also
Schema Class
Autodesk.Revit.DB.ExtensibleStorage Namespace